In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [10]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(69, 'Anabelle', 'Simpson', 'F', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (75, 'Joseph', 'Gutierrez', 'M', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, Decimal('233.40363'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', Decimal('NaN'), Decimal('NaN'))]

In [9]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.time(2, 33, 56, 796000), Decimal('2'), Decimal('11'), Decimal('45'), 11, 2018, '6'),
 (datetime.time(2, 36, 10, 796000), Decimal('2'), Decimal('11'), Decimal('45'), 11, 2018, '6'),
 (datetime.time(2, 40, 34, 796000), Decimal('2'), Decimal('11'), Decimal('45'), 11, 2018, '6'),
 (datetime.time(4, 36, 13, 796000), Decimal('4'), Decimal('11'), Decimal('45'), 11, 2018, '6'),
 (datetime.time(4, 36, 46, 796000), Decimal('4'), Decimal('11'), Decimal('45'), 11, 2018, '6')]

### Taking a look at data files

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_json('data/log_data/2018/11/2018-11-04-events.json', lines=True)
df.head()

In [ ]:
df.columns

In [ ]:
song = pd.read_json('data/song_data/A/A/A/TRAAABD128F429CF47.json', lines=True)
song.head()

In [ ]:
song = pd.read_json('data/song_data/A/A/A/TRAAARJ128F9320760.json', lines=True)
song.head()

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).